bench/beego-crud/bench.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        beegoServer:1.12.3
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   0.463 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      103000 bytes
Total body sent:        170000
HTML transferred:       0 bytes
Requests per second:    2160.78 [#/sec] (mean)
Time per request:       23.140 [ms] (mean)
Time per request:       0.463 [ms] (mean, across all concurrent requests)
Transfer rate:          217.34 [Kbytes/sec] received
                        358.72 kb/s sent
                        576.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     1   22  13.0     22      74
Waiting:        1   22  12.9     22      74
Total:          1   22  13.1     22      75

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     27
  75%     31
  80%     33
  90%     39
  95%     43
  98%     58
  99%     59
 100%     75 (longest request)